# Варіант 7

import math

p1 = 0.5
p2 = 0.5
p3 = 0.99
p4 = 0.01

inc1 = 3000
inc2 = 2000
inc3 = 2510
inc4 = 1510

M_1 = p1 * inc1 + p2 * inc2
M_2 = p3 * inc3 + p4 * inc4

print(f"Сподіване значення проекту 1: {M_1:.2f}")
print(f"Сподіване значення проекту 2: {M_2:.2f}")

V_1 = (inc1 - M_1) ** 2 * p1 + (inc2 - M_1) ** 2 * p2
V_2 = (inc3 - M_2) ** 2 * p3 + (inc4 - M_2) ** 2 * p4

CV_1 = math.sqrt(V_1) / M_1
CV_2 = math.sqrt(V_2) / M_2

print(f"Коефіцієнт варіації проекту 1: {CV_1:.2f}")
print(f"Коефіцієнт варіації проекту 2: {CV_2:.2f}")

if M_1 > M_2 and CV_1 < CV_2:
    print("Проект 1 має вищу сподівану величину та є менш ризикованим.")
elif M_1 < M_2 and CV_2 < CV_1:
    print("Проект 2 має вищу сподівану величину та є менш ризикованим.")
elif M_1 == M_2:
    if CV_1 < CV_2:
        print("Обидва проекти мають однакову сподівану величину, але проект 1 менш ризикований.")
    elif CV_1 > CV_2:
        print("Обидва проекти мають однакову сподівану величину, але проект 2 менш ризикований.")
    else:
        print("Обидва проекти мають однакову сподівану величину та коефіцієнт варіації.")
