# Variant 7
import math

p = 0.5

money = 50

coefficient = 1/3
# first student U1(x) = 1.3x
# second student U2(x) = 1.4*sqrt(x)

print("Розглянемо випадок зберігання грошей: ")
U1_save = 1.3 * money
U2_save = 1.4 * math.sqrt(money)

print("Очікувана корисність, якщо 1 студент збереже гроші: ", U1_save)
print("Очікувана корисність, якщо 2 студент збереже гроші: ", U2_save)

print("Розглянемо випадок ставки: ")
U1_bet = 1.3 * (money / coefficient)
U2_bet = 1.4 * math.sqrt(money / coefficient)

print("Очікувана корисність, якщо 1 студент зробить ставку та виграє: ", U1_bet)
print("Очікувана корисність, якщо 2 студент зробить ставку та виграє: ", U2_bet)
print("При програші обидва студенти втрачають гроші та матимуть 0")

M_U1 = p * 0 + p * U1_bet
M_U2 = p * 0 + p * U2_bet

print("Загальна очікувана вартість 1 студента: ", M_U1)
print("Загальна очікувана вартість 2 студента: ", M_U2)

if M_U1 > U1_save:
    print("Найкраще рішення для 1 студента - зробити ставку, так як очікувана вартість є більшою ніж при зберіганні.")
else:
    print("Найкраще рішення для 1 студента - зберегти гроші, так як очікувана вартість є більшою ніж при ставці.")

if M_U2 > U2_save:
    print("Найкраще рішення для 2 студента - зробити ставку, так як очікувана вартість є більшою ніж при зберіганні.")
else:
    print("Найкраще рішення для 2 студента - зберегти гроші, так як очікувана вартість є більшою ніж при ставці.")
